Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/pio.h
/* -------- PIO_CFGR : (PIO Offset: 0x04) (R/W 32) PIO Configuration Register -------- */
#define PIO_CFGR_FUNC_Pos                     _U_(0)                                               /**< (PIO_CFGR) I/O Line Function Position */
#define PIO_CFGR_FUNC_Msk                     (_U_(0x7) << PIO_CFGR_FUNC_Pos)                      /**< (PIO_CFGR) I/O Line Function Mask */
#define PIO_CFGR_FUNC(value)                  (PIO_CFGR_FUNC_Msk & ((value) << PIO_CFGR_FUNC_Pos))
#define   PIO_CFGR_FUNC_GPIO_Val              _U_(0x0)                                             /**< (PIO_CFGR) Select the PIO mode for the selected I/O lines.  */
#define   PIO_CFGR_FUNC_PERIPH_A_Val          _U_(0x1)                                             /**< (PIO_CFGR) Select the peripheral A for the selected I/O lines.  */
#define   PIO_CFGR_FUNC_PERIPH_B_Val          _U_(0x2)                                             /**< (PIO_CFGR) Select the peripheral B for the selected I/O lines.  */
#define   PIO_CFGR_FUNC_PERIPH_C_Val          _U_(0x3)                                             /**< (PIO_CFGR) Select the peripheral C for the selected I/O lines.  */
#define   PIO_CFGR_FUNC_PERIPH_D_Val          _U_(0x4)                                             /**< (PIO_CFGR) Select the peripheral D for the selected I/O lines.  */
#define   PIO_CFGR_FUNC_PERIPH_E_Val          _U_(0x5)                                             /**< (PIO_CFGR) Select the peripheral E for the selected I/O lines.  */
#define   PIO_CFGR_FUNC_PERIPH_F_Val          _U_(0x6)                                             /**< (PIO_CFGR) Select the peripheral F for the selected I/O lines.  */
#define   PIO_CFGR_FUNC_PERIPH_G_Val          _U_(0x7)                                             /**< (PIO_CFGR) Select the peripheral G for the selected I/O lines.  */
#define PIO_CFGR_FUNC_GPIO                    (PIO_CFGR_FUNC_GPIO_Val << PIO_CFGR_FUNC_Pos)        /**< (PIO_CFGR) Select the PIO mode for the selected I/O lines. Position  */
#define PIO_CFGR_FUNC_PERIPH_A                (PIO_CFGR_FUNC_PERIPH_A_Val << PIO_CFGR_FUNC_Pos)    /**< (PIO_CFGR) Select the peripheral A for the selected I/O lines. Position  */
#define PIO_CFGR_FUNC_PERIPH_B                (PIO_CFGR_FUNC_PERIPH_B_Val << PIO_CFGR_FUNC_Pos)    /**< (PIO_CFGR) Select the peripheral B for the selected I/O lines. Position  */
#define PIO_CFGR_FUNC_PERIPH_C                (PIO_CFGR_FUNC_PERIPH_C_Val << PIO_CFGR_FUNC_Pos)    /**< (PIO_CFGR) Select the peripheral C for the selected I/O lines. Position  */
#define PIO_CFGR_FUNC_PERIPH_D                (PIO_CFGR_FUNC_PERIPH_D_Val << PIO_CFGR_FUNC_Pos)    /**< (PIO_CFGR) Select the peripheral D for the selected I/O lines. Position  */
#define PIO_CFGR_FUNC_PERIPH_E                (PIO_CFGR_FUNC_PERIPH_E_Val << PIO_CFGR_FUNC_Pos)    /**< (PIO_CFGR) Select the peripheral E for the selected I/O lines. Position  */
#define PIO_CFGR_FUNC_PERIPH_F                (PIO_CFGR_FUNC_PERIPH_F_Val << PIO_CFGR_FUNC_Pos)    /**< (PIO_CFGR) Select the peripheral F for the selected I/O lines. Position  */
#define PIO_CFGR_FUNC_PERIPH_G                (PIO_CFGR_FUNC_PERIPH_G_Val << PIO_CFGR_FUNC_Pos)    /**< (PIO_CFGR) Select the peripheral G for the selected I/O lines. Position  */
#define PIO_CFGR_DIR_Pos                      _U_(8)                                               /**< (PIO_CFGR) Direction Position */
#define PIO_CFGR_DIR_Msk                      (_U_(0x1) << PIO_CFGR_DIR_Pos)                       /**< (PIO_CFGR) Direction Mask */
#define PIO_CFGR_DIR(value)                   (PIO_CFGR_DIR_Msk & ((value) << PIO_CFGR_DIR_Pos))  
#define   PIO_CFGR_DIR_INPUT_Val              _U_(0x0)                                             /**< (PIO_CFGR) The selected I/O lines are pure inputs.  */
#define   PIO_CFGR_DIR_OUTPUT_Val             _U_(0x1)                                             /**< (PIO_CFGR) The selected I/O lines are enabled in output.  */
#define PIO_CFGR_DIR_INPUT                    (PIO_CFGR_DIR_INPUT_Val << PIO_CFGR_DIR_Pos)         /**< (PIO_CFGR) The selected I/O lines are pure inputs. Position  */
#define PIO_CFGR_DIR_OUTPUT                   (PIO_CFGR_DIR_OUTPUT_Val << PIO_CFGR_DIR_Pos)        /**< (PIO_CFGR) The selected I/O lines are enabled in output. Position  */
#define PIO_CFGR_PUEN_Pos                     _U_(9)                                               /**< (PIO_CFGR) Pull-Up Enable Position */
#define PIO_CFGR_PUEN_Msk                     (_U_(0x1) << PIO_CFGR_PUEN_Pos)                      /**< (PIO_CFGR) Pull-Up Enable Mask */
#define PIO_CFGR_PUEN(value)                  (PIO_CFGR_PUEN_Msk & ((value) << PIO_CFGR_PUEN_Pos))
#define   PIO_CFGR_PUEN_DISABLED_Val          _U_(0x0)                                             /**< (PIO_CFGR) Pull-Up is disabled for the selected I/O lines.  */
#define   PIO_CFGR_PUEN_ENABLED_Val           _U_(0x1)                                             /**< (PIO_CFGR) Pull-Up is enabled for the selected I/O lines.  */
#define PIO_CFGR_PUEN_DISABLED                (PIO_CFGR_PUEN_DISABLED_Val << PIO_CFGR_PUEN_Pos)    /**< (PIO_CFGR) Pull-Up is disabled for the selected I/O lines. Position  */
#define PIO_CFGR_PUEN_ENABLED                 (PIO_CFGR_PUEN_ENABLED_Val << PIO_CFGR_PUEN_Pos)     /**< (PIO_CFGR) Pull-Up is enabled for the selected I/O lines. Position  */
#define PIO_CFGR_PDEN_Pos                     _U_(10)                                              /**< (PIO_CFGR) Pull-Down Enable Position */
#define PIO_CFGR_PDEN_Msk                     (_U_(0x1) << PIO_CFGR_PDEN_Pos)                      /**< (PIO_CFGR) Pull-Down Enable Mask */
#define PIO_CFGR_PDEN(value)                  (PIO_CFGR_PDEN_Msk & ((value) << PIO_CFGR_PDEN_Pos))
#define   PIO_CFGR_PDEN_DISABLED_Val          _U_(0x0)                                             /**< (PIO_CFGR) Pull-Down is disabled for the selected I/O lines.  */
#define   PIO_CFGR_PDEN_ENABLED_Val           _U_(0x1)                                             /**< (PIO_CFGR) Pull-Down is enabled for the selected I/O lines only if PUEN is 0.  */
#define PIO_CFGR_PDEN_DISABLED                (PIO_CFGR_PDEN_DISABLED_Val << PIO_CFGR_PDEN_Pos)    /**< (PIO_CFGR) Pull-Down is disabled for the selected I/O lines. Position  */
#define PIO_CFGR_PDEN_ENABLED                 (PIO_CFGR_PDEN_ENABLED_Val << PIO_CFGR_PDEN_Pos)     /**< (PIO_CFGR) Pull-Down is enabled for the selected I/O lines only if PUEN is 0. Position  */
#define PIO_CFGR_OPD_Pos                      _U_(14)                                              /**< (PIO_CFGR) Open-Drain Position */
#define PIO_CFGR_OPD_Msk                      (_U_(0x1) << PIO_CFGR_OPD_Pos)                       /**< (PIO_CFGR) Open-Drain Mask */
#define PIO_CFGR_OPD(value)                   (PIO_CFGR_OPD_Msk & ((value) << PIO_CFGR_OPD_Pos))  
#define   PIO_CFGR_OPD_DISABLED_Val           _U_(0x0)                                             /**< (PIO_CFGR) The open-drain is disabled for the selected I/O lines. I/O lines are driven at high- and low-level.  */
#define   PIO_CFGR_OPD_ENABLED_Val            _U_(0x1)                                             /**< (PIO_CFGR) The open-drain is enabled for the selected I/O lines. I/O lines are driven at low-level only.  */
#define PIO_CFGR_OPD_DISABLED                 (PIO_CFGR_OPD_DISABLED_Val << PIO_CFGR_OPD_Pos)      /**< (PIO_CFGR) The open-drain is disabled for the selected I/O lines. I/O lines are driven at high- and low-level. Position  */
#define PIO_CFGR_OPD_ENABLED                  (PIO_CFGR_OPD_ENABLED_Val << PIO_CFGR_OPD_Pos)       /**< (PIO_CFGR) The open-drain is enabled for the selected I/O lines. I/O lines are driven at low-level only. Position  */
#define PIO_CFGR_SCHMITT_Pos                  _U_(15)                                              /**< (PIO_CFGR) Schmitt Trigger Position */
#define PIO_CFGR_SCHMITT_Msk                  (_U_(0x1) << PIO_CFGR_SCHMITT_Pos)                   /**< (PIO_CFGR) Schmitt Trigger Mask */
#define PIO_CFGR_SCHMITT(value)               (PIO_CFGR_SCHMITT_Msk & ((value) << PIO_CFGR_SCHMITT_Pos))
#define   PIO_CFGR_SCHMITT_ENABLED_Val        _U_(0x0)                                             /**< (PIO_CFGR) Schmitt trigger is enabled for the selected I/O lines.  */
#define   PIO_CFGR_SCHMITT_DISABLED_Val       _U_(0x1)                                             /**< (PIO_CFGR) Schmitt trigger is disabled for the selected I/O lines.  */
#define PIO_CFGR_SCHMITT_ENABLED              (PIO_CFGR_SCHMITT_ENABLED_Val << PIO_CFGR_SCHMITT_Pos) /**< (PIO_CFGR) Schmitt trigger is enabled for the selected I/O lines. Position  */
#define PIO_CFGR_SCHMITT_DISABLED             (PIO_CFGR_SCHMITT_DISABLED_Val << PIO_CFGR_SCHMITT_Pos) /**< (PIO_CFGR) Schmitt trigger is disabled for the selected I/O lines. Position  */
#define PIO_CFGR_DRVSTR_Pos                   _U_(16)                                              /**< (PIO_CFGR) Drive Strength Position */
#define PIO_CFGR_DRVSTR_Msk                   (_U_(0x7) << PIO_CFGR_DRVSTR_Pos)                    /**< (PIO_CFGR) Drive Strength Mask */
#define PIO_CFGR_DRVSTR(value)                (PIO_CFGR_DRVSTR_Msk & ((value) << PIO_CFGR_DRVSTR_Pos))
#define   PIO_CFGR_DRVSTR_OUT_2m_Val          _U_(0x0)                                             /**< (PIO_CFGR) Output drive is 2mA  */
#define   PIO_CFGR_DRVSTR_OUT_4m_Val          _U_(0x1)                                             /**< (PIO_CFGR) Output drive is 4mA  */
#define   PIO_CFGR_DRVSTR_OUT_8m_Val          _U_(0x2)                                             /**< (PIO_CFGR) Output drive is 8mA  */
#define   PIO_CFGR_DRVSTR_OUT_16m_Val         _U_(0x3)                                             /**< (PIO_CFGR) Output drive is 16mA  */
#define   PIO_CFGR_DRVSTR_OUT_24m_Val         _U_(0x4)                                             /**< (PIO_CFGR) Output drive is 24mA  */
#define   PIO_CFGR_DRVSTR_OUT_32m_Val         _U_(0x5)                                             /**< (PIO_CFGR) Output drive is 32mA  */
#define   PIO_CFGR_DRVSTR_OUT_40m_Val         _U_(0x6)                                             /**< (PIO_CFGR) Output drive is 40mA  */
#define   PIO_CFGR_DRVSTR_OUT_48m_Val         _U_(0x7)                                             /**< (PIO_CFGR) Output drive is 48mA  */
#define PIO_CFGR_DRVSTR_OUT_2m                (PIO_CFGR_DRVSTR_OUT_2m_Val << PIO_CFGR_DRVSTR_Pos)  /**< (PIO_CFGR) Output drive is 2mA Position  */
#define PIO_CFGR_DRVSTR_OUT_4m                (PIO_CFGR_DRVSTR_OUT_4m_Val << PIO_CFGR_DRVSTR_Pos)  /**< (PIO_CFGR) Output drive is 4mA Position  */
#define PIO_CFGR_DRVSTR_OUT_8m                (PIO_CFGR_DRVSTR_OUT_8m_Val << PIO_CFGR_DRVSTR_Pos)  /**< (PIO_CFGR) Output drive is 8mA Position  */
#define PIO_CFGR_DRVSTR_OUT_16m               (PIO_CFGR_DRVSTR_OUT_16m_Val << PIO_CFGR_DRVSTR_Pos) /**< (PIO_CFGR) Output drive is 16mA Position  */
#define PIO_CFGR_DRVSTR_OUT_24m               (PIO_CFGR_DRVSTR_OUT_24m_Val << PIO_CFGR_DRVSTR_Pos) /**< (PIO_CFGR) Output drive is 24mA Position  */
#define PIO_CFGR_DRVSTR_OUT_32m               (PIO_CFGR_DRVSTR_OUT_32m_Val << PIO_CFGR_DRVSTR_Pos) /**< (PIO_CFGR) Output drive is 32mA Position  */
#define PIO_CFGR_DRVSTR_OUT_40m               (PIO_CFGR_DRVSTR_OUT_40m_Val << PIO_CFGR_DRVSTR_Pos) /**< (PIO_CFGR) Output drive is 40mA Position  */
#define PIO_CFGR_DRVSTR_OUT_48m               (PIO_CFGR_DRVSTR_OUT_48m_Val << PIO_CFGR_DRVSTR_Pos) /**< (PIO_CFGR) Output drive is 48mA Position  */
#define PIO_CFGR_EVTSEL_Pos                   _U_(24)                                              /**< (PIO_CFGR) Event Selection Position */
#define PIO_CFGR_EVTSEL_Msk                   (_U_(0x7) << PIO_CFGR_EVTSEL_Pos)                    /**< (PIO_CFGR) Event Selection Mask */
#define PIO_CFGR_EVTSEL(value)                (PIO_CFGR_EVTSEL_Msk & ((value) << PIO_CFGR_EVTSEL_Pos))
#define   PIO_CFGR_EVTSEL_FALLING_Val         _U_(0x0)                                             /**< (PIO_CFGR) Event detection on input falling edge  */
#define   PIO_CFGR_EVTSEL_RISING_Val          _U_(0x1)                                             /**< (PIO_CFGR) Event detection on input rising edge  */
#define   PIO_CFGR_EVTSEL_BOTH_Val            _U_(0x2)                                             /**< (PIO_CFGR) Event detection on input both edge  */
#define   PIO_CFGR_EVTSEL_LOW_Val             _U_(0x3)                                             /**< (PIO_CFGR) Event detection on low level input  */
#define   PIO_CFGR_EVTSEL_HIGH_Val            _U_(0x4)                                             /**< (PIO_CFGR) Event detection on high level input  */
#define PIO_CFGR_EVTSEL_FALLING               (PIO_CFGR_EVTSEL_FALLING_Val << PIO_CFGR_EVTSEL_Pos) /**< (PIO_CFGR) Event detection on input falling edge Position  */
#define PIO_CFGR_EVTSEL_RISING                (PIO_CFGR_EVTSEL_RISING_Val << PIO_CFGR_EVTSEL_Pos)  /**< (PIO_CFGR) Event detection on input rising edge Position  */
#define PIO_CFGR_EVTSEL_BOTH                  (PIO_CFGR_EVTSEL_BOTH_Val << PIO_CFGR_EVTSEL_Pos)    /**< (PIO_CFGR) Event detection on input both edge Position  */
#define PIO_CFGR_EVTSEL_LOW                   (PIO_CFGR_EVTSEL_LOW_Val << PIO_CFGR_EVTSEL_Pos)     /**< (PIO_CFGR) Event detection on low level input Position  */
#define PIO_CFGR_EVTSEL_HIGH                  (PIO_CFGR_EVTSEL_HIGH_Val << PIO_CFGR_EVTSEL_Pos)    /**< (PIO_CFGR) Event detection on high level input Position  */
#define PIO_CFGR_PCFS_Pos                     _U_(29)                                              /**< (PIO_CFGR) Physical Configuration Freeze Status (read-only) Position */
#define PIO_CFGR_PCFS_Msk                     (_U_(0x1) << PIO_CFGR_PCFS_Pos)                      /**< (PIO_CFGR) Physical Configuration Freeze Status (read-only) Mask */
#define PIO_CFGR_PCFS(value)                  (PIO_CFGR_PCFS_Msk & ((value) << PIO_CFGR_PCFS_Pos))
#define   PIO_CFGR_PCFS_NOT_FROZEN_Val        _U_(0x0)                                             /**< (PIO_CFGR) The fields are not frozen and can be written for this I/O line.  */
#define   PIO_CFGR_PCFS_FROZEN_Val            _U_(0x1)                                             /**< (PIO_CFGR) The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields.  */
#define PIO_CFGR_PCFS_NOT_FROZEN              (PIO_CFGR_PCFS_NOT_FROZEN_Val << PIO_CFGR_PCFS_Pos)  /**< (PIO_CFGR) The fields are not frozen and can be written for this I/O line. Position  */
#define PIO_CFGR_PCFS_FROZEN                  (PIO_CFGR_PCFS_FROZEN_Val << PIO_CFGR_PCFS_Pos)      /**< (PIO_CFGR) The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields. Position  */
#define PIO_CFGR_ICFS_Pos                     _U_(30)                                              /**< (PIO_CFGR) Interrupt Configuration Freeze Status (read-only) Position */
#define PIO_CFGR_ICFS_Msk                     (_U_(0x1) << PIO_CFGR_ICFS_Pos)                      /**< (PIO_CFGR) Interrupt Configuration Freeze Status (read-only) Mask */
#define PIO_CFGR_ICFS(value)                  (PIO_CFGR_ICFS_Msk & ((value) << PIO_CFGR_ICFS_Pos))
#define   PIO_CFGR_ICFS_NOT_FROZEN_Val        _U_(0x0)                                             /**< (PIO_CFGR) The fields are not frozen and can be written for this I/O line.  */
#define   PIO_CFGR_ICFS_FROZEN_Val            _U_(0x1)                                             /**< (PIO_CFGR) The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields.  */
#define PIO_CFGR_ICFS_NOT_FROZEN              (PIO_CFGR_ICFS_NOT_FROZEN_Val << PIO_CFGR_ICFS_Pos)  /**< (PIO_CFGR) The fields are not frozen and can be written for this I/O line. Position  */
#define PIO_CFGR_ICFS_FROZEN                  (PIO_CFGR_ICFS_FROZEN_Val << PIO_CFGR_ICFS_Pos)      /**< (PIO_CFGR) The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields. Position  */
#define PIO_CFGR_Msk                          _U_(0x6707C707)                                      /**< (PIO_CFGR) Register Mask  */


